robotology/icub-firmware/emBODY/eBcode/arch-arm/libs/lowlevel/stm32hal/src/board/strain2/v172/src/removed.main.c
  HAL_Delay(100);
  HAL_ADC_Start_DMA(&hadc1, (uint32_t*)adc_values, 6);
  
  HAL_Delay(1000);
  
  REGISTER=RAM_CFG0;
  //REGISTER=RAM_GDAC;
  
  while (1)
  {
    //CANBUS();
    TEMPERATURE();
    //BNO055();
    //BNO055_UART();
    
    if(PGA308_StartCalib){
      TIMER_PROG(1000);
      PGA308_StartCalib=0;
      PGA308_DefaultConfig();
    }
    else
    {
      if(REG_OK==0) {SelfCalibration(CHANNEL, REGISTER);}
      else{
        if(CHANNEL<6) {
          REG_OK=0;
          CHANNEL++;
        }
        else{
          if(REGISTER==RAM_CFG0){
            HAL_Delay(100);
            REGISTER=RAM_ZDAC;
            REG_OK=0;
            CHANNEL=1;
          }
          else if(REGISTER==RAM_ZDAC){
            TIMER_PROG(10000);
            REGISTER=RAM_GDAC;
          }
        }
      }
    }
    HAL_Delay(10);
    
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */

  }
  /* USER CODE END 3 */

}

/** System Clock Configuration
*/
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_PeriphCLKInitTypeDef PeriphClkInit;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI48|RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSI48State = RCC_HSI48_ON;
  RCC_OscInitStruct.HSICalibrationValue = 16;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART1|RCC_PERIPHCLK_USART2
                              |RCC_PERIPHCLK_I2C1|RCC_PERIPHCLK_I2C2
                              |RCC_PERIPHCLK_RNG|RCC_PERIPHCLK_ADC;
  PeriphClkInit.Usart1ClockSelection = RCC_USART1CLKSOURCE_PCLK2;
  PeriphClkInit.Usart2ClockSelection = RCC_USART2CLKSOURCE_PCLK1;
  PeriphClkInit.I2c1ClockSelection = RCC_I2C1CLKSOURCE_PCLK1;
  PeriphClkInit.I2c2ClockSelection = RCC_I2C2CLKSOURCE_PCLK1;
  PeriphClkInit.AdcClockSelection = RCC_ADCCLKSOURCE_SYSCLK;
  PeriphClkInit.RngClockSelection = RCC_RNGCLKSOURCE_HSI48;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the main internal regulator output voltage 
    */
  if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* USER CODE BEGIN 4 */
void HAL_SYSTICK_Callback(void)
{
//	static uint32_t count=0;
//	if(count==1000){
//		//HAL_GPIO_TogglePin(LED_BLUE_GPIO_Port, LED_BLUE_Pin);
//		count=0;
//	}
//	count++;
}

// -----------------------------------------------------------------------------------------------------------------------------
// Timers initialization
// -----------------------------------------------------------------------------------------------------------------------------
void TIMER_Init(void){
  __HAL_TIM_CLEAR_IT(&htim6, TIM_IT_UPDATE);
  __HAL_TIM_CLEAR_IT(&htim7, TIM_IT_UPDATE);
  __HAL_TIM_CLEAR_IT(&htim15, TIM_IT_UPDATE);
  __HAL_TIM_CLEAR_IT(&htim16, TIM_IT_UPDATE);
  
	HAL_TIM_Base_Start_IT(&htim16);
}

// -----------------------------------------------------------------------------------------------------------------------------
// FT Sensor Self-Calibration for any channel, by using coarse and fine offset tuning
// -----------------------------------------------------------------------------------------------------------------------------
void SelfCalibration(uint8_t channel, uint8_t reg){
  uint16_t DAC_OUT;
  
  if      (channel==1)  {DAC_OUT=adc_measure.STRAIN1;}
  else if (channel==2)  {DAC_OUT=adc_measure.STRAIN2;}
  else if (channel==3)  {DAC_OUT=adc_measure.STRAIN3;}
  else if (channel==4)  {DAC_OUT=adc_measure.STRAIN4;}
  else if (channel==5)  {DAC_OUT=adc_measure.STRAIN5;}
  else if (channel==6)  {DAC_OUT=adc_measure.STRAIN6;}
  
  if(reg==RAM_CFG0){
    PGA_CoarseOffset_Calib(channel, DAC_OUT);                         // Coarse calibration using CFG0.OS register
    PGA_StableRegister(PGA308[channel].CFG0_OS);                      // Check if value is stable or not
    if(REG_Value){                                                    // If value is not stable yet, write a better value in CFG0.OS
      PGA308[channel].CFG0 = ((PGA308[channel].CFG0 & 0xFF00) | PGA308[channel].CFG0_OS);
      PGA308_WriteRegister(channel, reg, PGA308[channel].CFG0);
    }
  }
  
  if(reg==RAM_ZDAC){
    PGA_FineOffset_Calib(channel, DAC_OUT);                           // Fine calibration using ZDAC register
    PGA_StableRegister(PGA308[channel].ZDAC);                         // Check if value is stable or not
    if(REG_Value){                                                    // If value is not stable yet, write a better value in ZDAC
      PGA308_WriteRegister(channel, reg, PGA308[channel].ZDAC);
    }
  }
}

// -----------------------------------------------------------------------------------------------------------------------------
// PGA308 Coarse Offset Calibration - Register CFG0.OS
// -----------------------------------------------------------------------------------------------------------------------------
void PGA_CoarseOffset_Calib(uint8_t channel, uint16_t DAC_OUT){
  if(DAC_OUT < 4300){                         // 4096 metà scala dell'ADC, metto diverso per poter poi calibrare finemente col Zero DAC
    if(PGA308[channel].CFG0_OS>>7 == 0) { 
      if(PGA308[channel].CFG0_OS<0x64)  {PGA308[channel].CFG0_OS++;}
    }
    else{
      if( (PGA308[channel].CFG0_OS & 0x7F) > 0)   {PGA308[channel].CFG0_OS--;}
      else                                        {PGA308[channel].CFG0_OS=0x00;}
    }
  }
  else{
    if(PGA308[channel].CFG0_OS>>7 == 0) {
      if( (PGA308[channel].CFG0_OS & 0x7F) > 0)   {PGA308[channel].CFG0_OS--;} 
      else                                        {PGA308[channel].CFG0_OS=0x80;}
    }
    else{
      if( (PGA308[channel].CFG0_OS & 0x7F)<0x64)  {PGA308[channel].CFG0_OS++;}
    }
  }
}

// -----------------------------------------------------------------------------------------------------------------------------
// PGA308 Fine Offset Calibration - Register ZDAC
// -----------------------------------------------------------------------------------------------------------------------------
void PGA_FineOffset_Calib(uint8_t channel, uint16_t DAC_OUT){
  if(DAC_OUT < 4096){                         // 4096 metà scala dell'ADC
    if(PGA308[channel].ZDAC > 0x0000)  {PGA308[channel].ZDAC--;}
  }
  else{
    if(PGA308[channel].ZDAC < 0xFFFF)  {PGA308[channel].ZDAC++;}
  }
}

// -----------------------------------------------------------------------------------------------------------------------------
// PGA308 Check the stability of register values
// -----------------------------------------------------------------------------------------------------------------------------
void PGA_StableRegister(uint16_t REGISTER){
  uint8_t i;
  REG_value_tran[REG_count]=REGISTER;
  if(REG_count < REG_max_count) {REG_count++;}
  else                          {REG_count=0; REG_GO=1;}
  
