robotology/icub-firmware/emBODY/eBcode/arch-arm/libs/lowlevel/stm32hal/src/board/strain2/v172/src/removed.main.c
  for(i=0; i<REG_max_count; i++){
    if(REG_value_tran[i] > REG_value_tran[REG_max_count]){
      if( (REG_value_tran[i] - REG_value_tran[REG_max_count]) <= 1){
        REG_tran++;
      }
    }
    else{
      if( REG_value_tran[REG_max_count] - (REG_value_tran[i]) <= 1){
        REG_tran++;
      }
    }
  }
  
  if(REG_GO){
    if(REG_tran != REG_max_count) {REG_Value=1;}
    else                          {REG_Value=0; REG_OK=1; REG_GO=0;}
  }
  REG_tran=0;
}

// -----------------------------------------------------------------------------------------------------------------------------
// CAN messages management
// -----------------------------------------------------------------------------------------------------------------------------
void CANBUS(void){
	switch(can_message){
    case 0x00:  
    {
      hcan1.pTxMsg->StdId   = 0x621;              // Polling
      hcan1.pTxMsg->Data[0] = 0xFF;               // Firmware version message
      //hcan1.pTxMsg->Data[1] = 0x00;               // Board type
      hcan1.pTxMsg->Data[1] = Firmware_vers;      // Firmware version
      hcan1.pTxMsg->Data[2] = Revision_vers;      // Revision version
      hcan1.pTxMsg->Data[3] = Build_number;       // Build number
      hcan1.pTxMsg->Data[4] = PGA308[1].CFG0_OS>>8;
      hcan1.pTxMsg->Data[5] = PGA308[1].CFG0_OS;
      hcan1.pTxMsg->Data[6] = 0;
      hcan1.pTxMsg->Data[7] = 0;
      HAL_CAN_Transmit_IT(&hcan1);
      can_message = 1;
    }
    break;
    
    case 0x01:  
    {
      hcan1.pTxMsg->StdId   = 0x621;              // Polling
      hcan1.pTxMsg->Data[0] = 0xFF;               // Firmware version message
      hcan1.pTxMsg->Data[1] = 0x01;               // Board type
      hcan1.pTxMsg->Data[2] = ((adc_measure.STRAIN1)>>8) & 0x000000FF;
      hcan1.pTxMsg->Data[3] = adc_measure.STRAIN1 & 0x000000FF;
      hcan1.pTxMsg->Data[4] = ((adc_measure.STRAIN2)>>8) & 0x000000FF;
      hcan1.pTxMsg->Data[5] = adc_measure.STRAIN2 & 0x000000FF;
      hcan1.pTxMsg->Data[6] = ((adc_measure.STRAIN3)>>8) & 0x000000FF;
      hcan1.pTxMsg->Data[7] = adc_measure.STRAIN3 & 0x000000FF;
      HAL_CAN_Transmit_IT(&hcan1);
      can_message = 2;
    }
    break;
    
    case 0x02:  
    {
      hcan1.pTxMsg->StdId   = 0x621;              // Polling
      hcan1.pTxMsg->Data[0] = 0xFF;               // Firmware version message
      hcan1.pTxMsg->Data[1] = 0x02;               // Board type
      hcan1.pTxMsg->Data[2] = ((adc_measure.STRAIN4)>>8) & 0x000000FF;
      hcan1.pTxMsg->Data[3] = adc_measure.STRAIN4 & 0x000000FF;
      hcan1.pTxMsg->Data[4] = ((adc_measure.STRAIN5)>>8) & 0x000000FF;
      hcan1.pTxMsg->Data[5] = adc_measure.STRAIN5 & 0x000000FF;
      hcan1.pTxMsg->Data[6] = ((adc_measure.STRAIN6)>>8) & 0x000000FF;
      hcan1.pTxMsg->Data[7] = adc_measure.STRAIN6 & 0x000000FF;
      HAL_CAN_Transmit_IT(&hcan1);
      can_message = 3;
    }
    break;
    
    case 0x03:  
    {
      hcan1.pTxMsg->StdId   = 0x621;              // Polling
      hcan1.pTxMsg->Data[0] = 0xFF;               // Firmware version message
      hcan1.pTxMsg->Data[1] = 0x03;               // Board type
      hcan1.pTxMsg->Data[2] = Temperature_TOPboard>>8;
      hcan1.pTxMsg->Data[3] = Temperature_TOPboard;
      hcan1.pTxMsg->Data[4] = Temperature_BOTboard>>8;
      hcan1.pTxMsg->Data[5] = Temperature_BOTboard;
      hcan1.pTxMsg->Data[6] = 0;
      hcan1.pTxMsg->Data[7] = 0;
      HAL_CAN_Transmit_IT(&hcan1);
      can_message = 0;
    }
    break;
     
    case 0x10:  
    {
      hcan1.pTxMsg->StdId   = 0x621;              // Polling
      hcan1.pTxMsg->Data[0] = 0xFF;               // Firmware version message
      //hcan1.pTxMsg->Data[1] = 0x00;               // Board type
      hcan1.pTxMsg->Data[1] = Firmware_vers;      // Firmware version
      hcan1.pTxMsg->Data[2] = Revision_vers;      // Revision version
      hcan1.pTxMsg->Data[3] = Build_number;       // Build number
      hcan1.pTxMsg->Data[4] = PGA308[1].CFG0_OS>>8;
      hcan1.pTxMsg->Data[5] = PGA308[1].CFG0_OS;
      hcan1.pTxMsg->Data[6] = 0;
      hcan1.pTxMsg->Data[7] = 0;
      HAL_CAN_Transmit_IT(&hcan1);
      can_message = 0;
    }
    break;
    
    default:    
    {
    }
    break;
  }
}

// -----------------------------------------------------------------------------------------------------------------------------
// Read the Sensor Temperature
// -----------------------------------------------------------------------------------------------------------------------------
void TEMPERATURE(void){
  Si705x_ReadTemperature(1);
}

// -----------------------------------------------------------------------------------------------------------------------------
// Read the IMU BNO055 I2C
// -----------------------------------------------------------------------------------------------------------------------------
void BNO055(void){
  BNO055_Read(0x08);
}

// -----------------------------------------------------------------------------------------------------------------------------
// Read the IMU BNO055 UART
// -----------------------------------------------------------------------------------------------------------------------------
void BNO055_UART(void){
  BNO055_UART_Read();
}


// -----------------------------------------------------------------------------------------------------------------------------
// I2C Callback
// -----------------------------------------------------------------------------------------------------------------------------
void HAL_I2C_MasterTxCpltCallback(I2C_HandleTypeDef *I2cHandle)
{
  if(I2cHandle->Instance==I2C1){
    HAL_I2C_Master_Receive_DMA(&hi2c1, (uint16_t)Si705x_I2C_ADDRESS, (uint8_t*)Si705x_I2C1_RxBuffer, sizeof(Si705x_I2C1_RxBuffer));
  }
  if(I2cHandle->Instance==I2C2){
    HAL_I2C_Master_Receive_DMA(&hi2c2, (uint16_t)Si705x_I2C_ADDRESS, (uint8_t*)Si705x_I2C2_RxBuffer, sizeof(Si705x_I2C2_RxBuffer));
    //HAL_I2C_Master_Receive_DMA(&hi2c2, (uint16_t)BNO055_I2C_ADDRESS, (uint8_t*)BNO055_RxBuffer, sizeof(BNO055_RxBuffer));
    
