robotology/icub-firmware/emBODY/eBcode/arch-arm/libs/lowlevel/stm32hal/src/board/strain2/v172/src/removed.main.c
  }
}

void HAL_I2C_MasterRxCpltCallback(I2C_HandleTypeDef *I2cHandle)
{
  if(I2cHandle->Instance==I2C1){
    Temperature_BOTcode = (Si705x_I2C1_RxBuffer[0]<<8) + Si705x_I2C1_RxBuffer[1];
    Temperature_BOTboard = ((17572*Temperature_BOTcode)/65536) - 4685;  // HEX temperature in degrees Celsius (x100)
  }
  if(I2cHandle->Instance==I2C2){
    Temperature_TOPcode = (Si705x_I2C2_RxBuffer[0]<<8) + Si705x_I2C2_RxBuffer[1];
    Temperature_TOPboard = ((17572*Temperature_TOPcode)/65536) - 4685;  // HEX temperature in degrees Celsius (x100)
  }
}

// -----------------------------------------------------------------------------------------------------------------------------
// UART Callback
// -----------------------------------------------------------------------------------------------------------------------------
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart){
  HAL_UART_Receive_DMA(&huart1,(uint8_t*)UART_Rx_buffer, sizeof(UART_Rx_buffer));
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart){
  HAL_UART_Transmit_DMA(&huart1,(uint8_t*)UART_Rx_buffer, sizeof(UART_Rx_buffer));
}

// -----------------------------------------------------------------------------------------------------------------------------
// Timers Callback
// -----------------------------------------------------------------------------------------------------------------------------
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim){
  if(htim->Instance==TIM6){         // timer 10ms
    if(bit_count_rel==0){       // START condition of One-Wire Protocol
      PGA308_BitValue(PGA308_channel, LOW);
      bit_count_rel++;
    }
    else if(bit_count_rel==9){   // STOP condition of One-Wire Protocol
      PGA308_BitValue(PGA308_channel, HIGH);
      bit_count_rel=0;
      byte_count++;
    }
    else{                       // Transmission of One-Wire Protocol
      if(bit_count<PGA308_DimBufferTXbit){
        if(((PGA308_BufferTx[byte_count])>>(bit_count_rel-1)) & 0x01){
          PGA308_BitValue(PGA308_channel, HIGH);
        }
        else{
          PGA308_BitValue(PGA308_channel, LOW);
        }
        bit_count++;
        bit_count_rel++;
      }
      else{
        PGA308_BitValue(PGA308_channel, HIGH);
        HAL_TIM_Base_Stop_IT(&htim6);
        bit_count=0;
        bit_count_rel=0;
        byte_count=0;
        HAL_TIM_Base_Start_IT(&htim15);
        REG_Value=0;
      }
    }
	}
  
	if(htim->Instance==TIM7){        // timer 100ms
    if(bit_count_rel==0){       // START condition of One-Wire Protocol
      PGA308_BitValue(PGA308_channel, LOW);
      bit_count_rel++;
    }
    else if(bit_count_rel==9){   // STOP condition of One-Wire Protocol
      PGA308_BitValue(PGA308_channel, HIGH);
      bit_count_rel=0;
      byte_count++;
    }
    else{                       // Transmission of One-Wire Protocol
      if(bit_count<16){
        if(((PGA308_BufferTx[byte_count])>>(bit_count_rel-1)) & 0x01){
          PGA308_BitValue(PGA308_channel, HIGH);
        }
        else{
          PGA308_BitValue(PGA308_channel, LOW);
        }
        bit_count++;
        bit_count_rel++;
      }
      else{
        PGA308_BitValue(PGA308_channel, HIGH);
        HAL_TIM_Base_Stop_IT(&htim7);
        bit_count=0;
        bit_count_rel=0;
        byte_count=0;
        HAL_TIM_Base_Start_IT(&htim15);
        can_message=0x10;
      }
    }
	}
  
  if(htim->Instance==TIM15){        // timer 20ms
    PGA308_StartComm=0;
    HAL_TIM_Base_Stop_IT(&htim15);
	}
  
  if(htim->Instance==TIM16){        // timer xxx ms 
    HAL_GPIO_TogglePin(LED_GPIO_Port, LED_Pin);
	}
}


void TIMER_PROG(uint16_t value){     // example: value=10000 -> 1s, value=1000 -> 100ms, value=100 -> 10ms  
  htim16.Init.Period = value;
  HAL_TIM_Base_Init(&htim16);
}


// -----------------------------------------------------------------------------------------------------------------------------
// ADC
// -----------------------------------------------------------------------------------------------------------------------------
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc){
  HAL_ADC_Stop_DMA(&hadc1);
  adc_measure.STRAIN1 = (*(adc_values+0));//*0.687+58.5;     // mV
  adc_measure.STRAIN2 = (*(adc_values+1));//*0.687+58.5;     // mV
  adc_measure.STRAIN3 = (*(adc_values+2));//*0.687+58.5;     // mV
  adc_measure.STRAIN4 = (*(adc_values+3));//*0.687+58.5;     // mV
  adc_measure.STRAIN5 = (*(adc_values+4));//*0.687+58.5;     // mV
  adc_measure.STRAIN6 = (*(adc_values+5));//*0.687+58.5;     // mV
  //calcMean();
  CANBUS();
}

void calcMean(){
  adc_samples.STRAIN1[adc_sample] = adc_measure.STRAIN1;
  adc_samples.STRAIN2[adc_sample] = adc_measure.STRAIN2;
  adc_samples.STRAIN3[adc_sample] = adc_measure.STRAIN3;
  adc_samples.STRAIN4[adc_sample] = adc_measure.STRAIN4;
  adc_samples.STRAIN5[adc_sample] = adc_measure.STRAIN5;
  adc_samples.STRAIN6[adc_sample] = adc_measure.STRAIN6;
  
  if(adc_sample < (nr_adc_sample-1))  {adc_sample++;}
  else                                {adc_sample=0;}
  
  mean.STRAIN1=0;
	mean.STRAIN2=0;
	mean.STRAIN3=0;
	mean.STRAIN4=0;
	mean.STRAIN5=0;
	mean.STRAIN6=0;
  
  for(uint16_t i=0; i < nr_adc_sample; i++){
    mean.STRAIN1 += adc_samples.STRAIN1[i];
    mean.STRAIN2 += adc_samples.STRAIN2[i];
    mean.STRAIN3 += adc_samples.STRAIN3[i];
    mean.STRAIN4 += adc_samples.STRAIN4[i];
    mean.STRAIN5 += adc_samples.STRAIN5[i];
    mean.STRAIN6 += adc_samples.STRAIN6[i];
  }
  
  mean.STRAIN1 = mean.STRAIN1 / nr_adc_sample;
  mean.STRAIN2 = mean.STRAIN2 / nr_adc_sample;
  mean.STRAIN3 = mean.STRAIN3 / nr_adc_sample;
  mean.STRAIN4 = mean.STRAIN4 / nr_adc_sample;
  mean.STRAIN5 = mean.STRAIN5 / nr_adc_sample;
  mean.STRAIN6 = mean.STRAIN6 / nr_adc_sample;
}


void CheckTransient(){

}


/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void _Error_Handler(char * file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler_Debug */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
